{
  "architectures": [
    "DeepseekV3ForCausalLM"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "bos_token_id": 0,
  "dtype": "float32",
  "eos_token_id": 1,
  "first_k_dense_replace": 1,
  "head_dim": 8,
  "hidden_act": "silu",
  "hidden_size": 64,
  "initializer_range": 0.02,
  "intermediate_size": 128,
  "kv_lora_rank": 16,
  "max_position_embeddings": 4096,
  "model_type": "kimi_k2",
  "moe_intermediate_size": 16,
  "n_group": 1,
  "n_routed_experts": 16,
  "n_shared_experts": 1,
  "norm_topk_prob": true,
  "num_attention_heads": 4,
  "num_experts_per_tok": 8,
  "num_hidden_layers": 3,
  "num_key_value_heads": 4,
  "num_nextn_predict_layers": 0,
  "pad_token_id": null,
  "pretraining_tp": 1,
  "q_lora_rank": 32,
  "qk_head_dim": 16,
  "qk_nope_head_dim": 8,
  "qk_rope_head_dim": 8,
  "rms_norm_eps": 1e-06,
  "rope_interleave": true,
  "rope_parameters": {
    "rope_theta": 50000.0,
    "rope_type": "default"
  },
  "routed_scaling_factor": 2.827,
  "tie_word_embeddings": false,
  "topk_group": 1,
  "transformers_version": "5.14.1",
  "use_cache": true,
  "v_head_dim": 16,
  "vocab_size": 256,
  "scoring_func": "sigmoid",
  "topk_method": "noaux_tc",
  "rope_theta": 50000.0,
  "quantization_config": {
    "activation_scheme": "dynamic",
    "fmt": "e4m3",
    "quant_method": "fp8",
    "weight_block_size": [
      128,
      128
    ]
  }
}
